import React from "react";

const Java = () => {
   return(
      <div className="">
         <h1>Проект интернет магазина на Java Spring Framework</h1>
         <div className="javaBlock">
            <p>Данный проект является совокупностью знаний о языке программирования Java Spring Framework, Sql, MySql, Rest API, Json, Git, Spring Core, Spring Security, Hybernate, Fetch, Spring Data JPA и других технологий.</p>
            <p>Данное веб приложении содержит такие элекменты как:
               <ul>
                  <li>• Аутентификация. </li>
                  <li>• Авторизация по ролям. </li>
                  <li>• Шифрование паролей.</li>
                  <li>• Личный кабинет администратора со следующими функциями: 
               добавление, удаление, редактирование, просмотр товаров, работа с фотографиями, возможность выхода из личного кабинета. </li>
                  <li>• Личный кабинет пользователя со следующими функциями: поиск, сортировка, фильтрация товаров, просмотр карточек с товаром (фотография, цена, наименование), подробная информация о товаре при нажатии на наименование, добавление товаров в корзину, переход на страницу с корзиной, просмотр товаров в корзине, удаление товаров из корзины, оформление заказа, очищение корзины после оформления заказа, переход на страницу заказов, просмотр истории заказов, выход из личного кабинета. </li>
                  <li>• Главная страница сайта для неавторизованных пользователей должна включать в себя следующий функционал: просмотр карточек с товарами (фотография, цена, наименование), просмотр подробной информации о товаре, поиск, фильтрация, сортировка по товарам. </li>
                  <li>• В личном кабинете администратора реализована возможность просматривать заказы, изменять статус у заказа, осуществлять поиск по 4 последним буквам/цифрам заказа. </li>
                  <li>• Для Администратора реализована возможность просмотра информации о пользователях. </li>
                  <li>• Для Администратора реализована возможность смены роли у пользователя. </li>
               </ul>
                      
            </p>

            <p> Для демонстрации возможностей приложения можно увидеть сопровождающее видео</p>
            


         </div>
      </div>
   )
}

export default Java